# Excercise

In [4]:
import pandas as pd
import scipy as sp
import pandas as pd
import matplotlib as mpl
%matplotlib inline

In [5]:
df = pd.read_csv('vacaciones.csv')

In [6]:
df.head()

       semana  vacaciones  playa
0  16/02/2014           7     36
1  23/02/2014           6     36
2  02/03/2014           8     39
3  09/03/2014           8     43
4  16/03/2014           8     42

In [7]:
df['semana']

0      16/02/2014
1      23/02/2014
2      02/03/2014
3      09/03/2014
4      16/03/2014
5      23/03/2014
6      30/03/2014
7      06/04/2014
8      13/04/2014
9      20/04/2014
10     27/04/2014
11     04/05/2014
12     11/05/2014
13     18/05/2014
14     25/05/2014
15     01/06/2014
16     08/06/2014
17     15/06/2014
18     22/06/2014
19     29/06/2014
20     06/07/2014
21     13/07/2014
22     20/07/2014
23     27/07/2014
24     03/08/2014
25     10/08/2014
26     17/08/2014
27     24/08/2014
28     31/08/2014
29     07/09/2014
          ...
231    22/07/2018
232    29/07/2018
233    05/08/2018
234    12/08/2018
235    19/08/2018
236    26/08/2018
237    02/09/2018
238    09/09/2018
239    16/09/2018
240    23/09/2018
241    30/09/2018
242    07/10/2018
243    14/10/2018
244    21/10/2018
245    28/10/2018
246    04/11/2018
247    11/11/2018
248    18/11/2018
249    25/11/2018
250    02/12/2018
251    09/12/2018
252    16/12/2018
253    23/12/2018
254    30/12/2018
255    06/01/2019
256    13/01/2019
257    20/01/2019
258    27/01/2019
259    03/02/2019
260    10/02/2019
Name: semana, Length: 261, dtype: object

In [8]:
df['semana'].dtype

dtype('O')

In [9]:
df_hall = pd.read_csv('halloween.csv')

In [10]:
df_hall.head()

         week  halloween  costumes
0  16/02/2014          1         1
1  23/02/2014          1         1
2  02/03/2014          1         1
3  09/03/2014          1         1
4  16/03/2014          1         1

In [11]:
df_hall.dtypes

week         object
halloween     int64
costumes      int64
dtype: object

In [12]:
df_hall['week']

0      16/02/2014
1      23/02/2014
2      02/03/2014
3      09/03/2014
4      16/03/2014
5      23/03/2014
6      30/03/2014
7      06/04/2014
8      13/04/2014
9      20/04/2014
10     27/04/2014
11     04/05/2014
12     11/05/2014
13     18/05/2014
14     25/05/2014
15     01/06/2014
16     08/06/2014
17     15/06/2014
18     22/06/2014
19     29/06/2014
20     06/07/2014
21     13/07/2014
22     20/07/2014
23     27/07/2014
24     03/08/2014
25     10/08/2014
26     17/08/2014
27     24/08/2014
28     31/08/2014
29     07/09/2014
          ...
231    22/07/2018
232    29/07/2018
233    05/08/2018
234    12/08/2018
235    19/08/2018
236    26/08/2018
237    02/09/2018
238    09/09/2018
239    16/09/2018
240    23/09/2018
241    30/09/2018
242    07/10/2018
243    14/10/2018
244    21/10/2018
245    28/10/2018
246    04/11/2018
247    11/11/2018
248    18/11/2018
249    25/11/2018
250    02/12/2018
251    09/12/2018
252    16/12/2018
253    23/12/2018
254    30/12/2018
255    06/01/2019
256    13/01/2019
257    20/01/2019
258    27/01/2019
259    03/02/2019
260    10/02/2019
Name: week, Length: 261, dtype: object

In [15]:
df_hall['week'].dtype

dtype('O')

In [18]:
df_hall.dtypes

week         object
halloween     int64
costumes      int64
dtype: object

In [26]:
df_hall[df_hall['costumes'] > 30].count()

week         1
halloween    1
costumes     1
dtype: int64

In [23]:
df_hall.count()

week         261
halloween    261
costumes     261
dtype: int64

In [30]:
df_hall[df_hall['costumes'] > 30]

          week  halloween  costumes
88  25/10/2015        100        32

In [33]:
df_hall[['week','costumes']]

In [36]:
df_hall[30:50]

          week  halloween  costumes
30  14/09/2014         13         7
31  21/09/2014         18         9
32  28/09/2014         24        12
33  05/10/2014         29        14
34  12/10/2014         34        15
35  19/10/2014         46        19
36  26/10/2014         95        29
37  02/11/2014         10         3
38  09/11/2014          2         1
39  16/11/2014          2         1
40  23/11/2014          1         1
41  30/11/2014          1         1
42  07/12/2014          1         1
43  14/12/2014          1         1
44  21/12/2014          1         1
45  28/12/2014          1         1
46  04/01/2015          1         1
47  11/01/2015          1         1
48  18/01/2015          1         1
49  25/01/2015          1         1

In [38]:
df_hall.loc[30:50, ['halloween', 'week']]

    halloween        week
30         13  14/09/2014
31         18  21/09/2014
32         24  28/09/2014
33         29  05/10/2014
34         34  12/10/2014
35         46  19/10/2014
36         95  26/10/2014
37         10  02/11/2014
38          2  09/11/2014
39          2  16/11/2014
40          1  23/11/2014
41          1  30/11/2014
42          1  07/12/2014
43          1  14/12/2014
44          1  21/12/2014
45          1  28/12/2014
46          1  04/01/2015
47          1  11/01/2015
48          1  18/01/2015
49          1  25/01/2015
50          1  01/02/2015

In [46]:
df_hall.describe()

        halloween    costumes
count  261.000000  261.000000
mean     7.042146    3.011494
std     15.074754    4.836943
min      1.000000    1.000000
25%      1.000000    1.000000
50%      1.000000    1.000000
75%      3.000000    2.000000
max    100.000000   32.000000

In [48]:
df_hall['costumes'].agg(['count', 'min', 'max'])

count    261
min        1
max       32
Name: costumes, dtype: int64